In [3]:

import numpy as np
import pandas as pd

In [5]:
data=np.arange(0,20).reshape(5,4)

In [12]:
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4","Row5"],columns=["c1","c2","c3","c4"])

In [13]:
df.head()

      c1  c2  c3  c4
Row1   0   1   2   3
Row2   4   5   6   7
Row3   8   9  10  11
Row4  12  13  14  15
Row5  16  17  18  19

In [14]:
df.tail()

      c1  c2  c3  c4
Row1   0   1   2   3
Row2   4   5   6   7
Row3   8   9  10  11
Row4  12  13  14  15
Row5  16  17  18  19

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int32
 1   c2      5 non-null      int32
 2   c3      5 non-null      int32
 3   c4      5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [ ]:
#indexing
#columnindex and rowindex

In [22]:
df['c1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: c1, dtype: int32

In [23]:
df[['c1','c2']]

      c1  c2
Row1   0   1
Row2   4   5
Row3   8   9
Row4  12  13
Row5  16  17

In [24]:
df.iloc[2:4,0:2]

      c1  c2
Row3   8   9
Row4  12  13

In [25]:
df.isnull().sum()

c1    0
c2    0
c3    0
c4    0
dtype: int64